# Напишіть функцію common_elements, яка згенерує два списки елементів з генераторного виразу (range) для 100 елементів, за наступними правилом:
# Один список з числами кратними 3, інший з кратними числами 5.
# За допомогою множин створіть набір з числами, які є в обох множинах (перетин).
# Функція повинна повернути цю множину як результат своєї роботu.
def common_elements():
    spisok3 = {x for x in range(100) if x % 3 == 0}
    spisok5 = {x for x in range(100) if x % 5 == 0}
    return spisok3 & spisok5


assert common_elements() == {0, 15, 30, 45, 60, 75, 90}
print(common_elements())
